let arr = new Array(); 

let major =["학과"];
    major[1] = ["경영정보학과", "경영학부", " 국제경영학과"];
    major[2] = ["건축공학과", "건축학과", "공업화학과", "기계공학부", "도시공학과", "신소재공학과", "안전공학과", "테크노산업공학과", "토목공학부", "화학공학과", "환경공학과"];
    major[3] = ["농업경제학과", "목재종이과학과", "바이오시스템공학과", "산림학과", "식물의학과", "식물자원학과", "식품생명공학과", "원예과학과", "지역건설공학과", "축산학과", "특용식물학과", "환경생명화학과"];
    major[4] = ["방사광융합학과", "제약바이오학과", "천연물소재학과", "화장품산업학과"];
    major[5] = ["교육학과", "국어교육과", "물리교육과", "사회교육과", "생물교육과", "수학교육과", "역사교육과", "영어교육과", "윤리교육과", "지구과학교육과", "지리교육과", "체육교육과", "화학교육과"];
    major[6] = ["경제학과", "사회학과", "심리학과", "정치외교학과", "행정학과"];
    major[7] = ["소비자학과", "식품영양학과", "아동복지학과", "의류학과", "주거환경학과"];
    major[8] = ["수의예과", "수의학과"];
    major[9] = ["약학과", "제약학과"];
    major[10] = ["공통과학교육전공", "통합과학교육전공", "통합사회교육전공"];
    major[11] = ["과학커뮤니케이션", "국제개발협력과거버넌스", "노인복지", "농촌관광개발", "문화유산의공간정보학", "문화콘텐츠", "박물관전문인력", "번역출판전공", "벤처비즈니스전공", "보안컨설팅전공", "빅데이터", "사회적기업", "스마트자동차공학", "언론정보전공", "영한통역", "위기관리", "해외농업개발ㆍ협력전공", "지식재산스마트융합"];
    major[12] = ["디자인학과", "조형예술학과"];
    major[13] = ["간호학과", "의예과", "의학과"];
    major[14] = ["고고미술사학과", "국어국문학과", "독일언어문화학과", "러시아언어문화학과", "사학과", "영어영문학과", "중어중문학과", "철학과", "프랑스언어문화학과"];
    major[15] = ["물리학과", "미생물학과", "생명과학과", "생화학과", "수학과", "정보통계학과", "지구환경과학과", "천문우주학과", "화학과"];
    major[16] = ["SW융합부전공", "소프트웨어학과", "소프트웨어학부", "전기공학부", "전자공학부", "정보통신공학부", "지능로봇공학과", "컴퓨터공학과"];

    let target = document.getElementById("major");
    let opt = document.createElement("option");
    opt.value = "0";
    opt.innerHTML = "학과 선택";
    target.appendChild(opt);

function categoryChange(e) {
    let major =["학과"];
    major[1] = ["경영정보학과", "경영학부", " 국제경영학과"];
    major[2] = ["건축공학과", "건축학과", "공업화학과", "기계공학부", "도시공학과", "신소재공학과", "안전공학과", "테크노산업공학과", "토목공학부", "화학공학과", "환경공학과"];
    major[3] = ["농업경제학과", "목재종이과학과", "바이오시스템공학과", "산림학과", "식물의학과", "식물자원학과", "식품생명공학과", "원예과학과", "지역건설공학과", "축산학과", "특용식물학과", "환경생명화학과"];
    major[4] = ["방사광융합학과", "제약바이오학과", "천연물소재학과", "화장품산업학과"];
    major[5] = ["교육학과", "국어교육과", "물리교육과", "사회교육과", "생물교육과", "수학교육과", "역사교육과", "영어교육과", "윤리교육과", "지구과학교육과", "지리교육과", "체육교육과", "화학교육과"];
    major[6] = ["경제학과", "사회학과", "심리학과", "정치외교학과", "행정학과"];
    major[7] = ["소비자학과", "식품영양학과", "아동복지학과", "의류학과", "주거환경학과"];
    major[8] = ["수의예과", "수의학과"];
    major[9] = ["약학과", "제약학과"];
    major[10] = ["공통과학교육전공", "통합과학교육전공", "통합사회교육전공"];
    major[11] = ["과학커뮤니케이션", "국제개발협력과거버넌스", "노인복지", "농촌관광개발", "문화유산의공간정보학", "문화콘텐츠", "박물관전문인력", "번역출판전공", "벤처비즈니스전공", "보안컨설팅전공", "빅데이터", "사회적기업", "스마트자동차공학", "언론정보전공", "영한통역", "위기관리", "해외농업개발ㆍ협력전공", "지식재산스마트융합"];
    major[12] = ["디자인학과", "조형예술학과"];
    major[13] = ["간호학과", "의예과", "의학과"];
    major[14] = ["고고미술사학과", "국어국문학과", "독일언어문화학과", "러시아언어문화학과", "사학과", "영어영문학과", "중어중문학과", "철학과", "프랑스언어문화학과"];
    major[15] = ["물리학과", "미생물학과", "생명과학과", "생화학과", "수학과", "정보통계학과", "지구환경과학과", "천문우주학과", "화학과"];
    major[16] = ["SW융합부전공", "소프트웨어학과", "소프트웨어학부", "전기공학부", "전자공학부", "정보통신공학부", "지능로봇공학과", "컴퓨터공학과"];

    let target = document.getElementById("major");
    let i = e.value;
    let d = major[i];

    target.options.length = 1;

    for (x in d) {
        opt = document.createElement("option");
        opt.value = d[x];
        opt.innerHTML = d[x];
        target.appendChild(opt);
    }
}

for (var i = 0; i < arr.length; i++) {
    console.log(arr[i][1]);
}

function sortTable(n) {
    
    let table, rows, x, y;
    table = document.getElementById(table);
    
}

