let arr = new Array(); 

//arr[3][5]
//손수 만든 예시용 배열(나중엔 parsing된 데이터 이용)
arr[0] = ["오픈소스기초프로젝트~~!", "강재구", "전공", 0.82, 81];
arr[1] = ["자료구조", "이의종", "전공", 0.5, 23];
arr[2] = ["인간과 기계문명", "김연순", "교양", 1, 62];
arr[3] = ["오픈소스기초프로젝트~~!", "강재구", "전공", 0.82, 81];
arr[4] = ["자료구조", "이의종", "전공", 0.5, 23];
arr[5] = ["인간과 기계문명", "김연순", "교양", 1, 62];
arr[6] = ["오픈소스기초프로젝트~~!", "강재구", "전공", 0.82, 81];
arr[7] = ["자료구조", "이의종", "전공", 0.5, 23];
arr[8] = ["인간과 기계문명", "김연순", "교양", 1, 62];
arr[9] = ["오픈소스기초프로젝트~~!", "강재구", "전공", 0.82, 81];
// arr[10] = ["자료구조", "이의종", "전공", 0.5, 23];
// arr[11] = ["인간과 기계문명", "김연순", "교양", 1, 62];

for (var i = 0; i < arr.length; i++) {
    console.log(arr[i][1]);
}

